{
  "offside": "A player is offside if any part of the head, body or feet is nearer to the opponents' goal line than both the ball and the second-last defender when the ball is played to them, except in their own half. Being offside is not an offence by itself; involvement is required.",
  "xg": "Expected Goals (xG) estimates the probability that a shot becomes a goal based on factors like distance, angle, body part, and assist type. Higher xG = higher chance.",
  "false nine": "A centre-forward who drops into midfield to create overloads, pulling centre-backs out of position and opening space for wide runners.",
  "high press": "A defensive tactic applying pressure high up the pitch to force turnovers and rush opponent build-up.",
  "4-3-3": "Four defenders, three midfielders, three forwards. Often wingers provide width, full-backs overlap, and a single pivot balances transitions.",
  "4-2-3-1": "Four defenders, two holding midfielders, three attacking midfielders, one striker. Provides defensive solidity with creative freedom.",
  "tiki-taka": "A playing style emphasizing short passing, movement, and maintaining possession to control the game tempo.",
  "gegenpressing": "Counter-pressing - immediately pressing the opponent after losing possession to win the ball back quickly.",
  "sweeper keeper": "A goalkeeper who actively participates in build-up play, often playing outside the penalty area.",
  "inverted winger": "A winger who cuts inside onto their stronger foot, creating space for overlapping full-backs.",
  "box-to-box": "A midfielder who contributes both defensively and offensively, covering the entire length of the pitch.",
  "regista": "A deep-lying playmaker who orchestrates play from behind, similar to a quarterback in football.",
  "trequartista": "An attacking midfielder who operates in the space between midfield and attack, creating chances.",
  "libero": "A free-roaming defender who sweeps behind the defensive line and initiates attacks.",
  "wing-back": "A player who combines the roles of winger and full-back, providing width and defensive cover.",
  "target man": "A tall, physical striker who holds up the ball and brings teammates into play.",
  "poacher": "A striker who specializes in scoring from close range, often in the penalty area.",
  "playmaker": "A creative player who dictates the tempo and creates scoring opportunities for teammates.",
  "destroyer": "A defensive midfielder whose primary role is to break up opposition attacks.",
  "pivot": "A defensive midfielder who sits in front of the defense and distributes the ball.",
  "overlap": "When a full-back runs beyond a winger to provide width and crossing opportunities.",
  "underlap": "When a midfielder runs inside a winger to create central passing options.",
  "park the bus": "A defensive strategy where a team defends deep with many players behind the ball.",
  "route one": "A direct playing style using long balls from defense to attack, bypassing midfield.",
  "total football": "A tactical system where players can interchange positions fluidly during play.",
  "catenaccio": "An Italian defensive system with a sweeper and man-marking throughout the team.",
  "false full-back": "A full-back who moves into central midfield during possession to create numerical advantages.",
  "half-space": "The area between the center and the wing, often exploited by creative players.",
  "third man run": "A movement where a player makes a run to receive a pass after two other players have exchanged the ball.",
  "overload": "Creating numerical superiority in a specific area of the pitch to break down defenses."
}
